// Задание 2: Функции работы с каталогом
// Управление данными без мутации исходных объектов (иммутабельность)
// TODO 1: Добавьте книгу в каталог
// Параметры:
//   - catalog (Catalog): исходный каталог
//   - book (Book): книга для добавления
// Возвращает: новый объект Catalog, содержащий все старые книги и новую
// Подсказка: используйте оператор расширения (spread) `...`, чтобы создать новый объект, 
// а не изменять существующий. Ключом должно быть свойство book.id.
export function addBook(catalog, book) {
    return {
        ...catalog,
        [book.id]: book,
    };
}
// TODO 2: Удалите книгу из каталога по id
// Параметры:
//   - catalog (Catalog): исходный каталог
//   - id (string): идентификатор книги для удаления
// Возвращает: новый объект Catalog без указанной книги
//  Подсказка: используйте деструктуризацию объекта с вычисляемым ключом и rest-параметром:
export function removeBook(catalog, id) {
    const { [id]: _, ...rest } = catalog;
    return rest;
}
// TODO 3: Найдите книгу в каталоге по id
// Параметры:
//   - catalog (Catalog): исходный каталог
//   - id (string): идентификатор искомой книги
// Возвращает: объект Book, если книга найдена, или undefined, если её нет
export function getBook(catalog, id) {
    return catalog[id];
}
